# Задача 1
print (37/10)
print (37//10)
print (37%10)

# Задача 2
print ('hello world')

#Задача 3
a = 3
print(type(a))
a = 3.5
print(type(a))
a = 'qwerty'
print(type(a))
a = True
print(type(a))
a = '123'
print(type(a))
#если попробовать сложить строку с числом -
#будет ошибка типа
#в том же JavaScript, например, число преобразовалось бы в строку
#и слилось, благодаря конкатенации и отсутствию строгой типизации

#Задача 4
asd = int(5.7)
print(asd)
asdf = int(-5.7)
print(asdf)
asdfg = int(float(3**39))
print(asdfg)
#получилось очень большое число (????)

#Задача 5

